{
  "nodes": [
    {
      "id": 1,
      "label": "Ajax",
      "desc": "(англ. Asynchronous Javascript and XML – «асинхронный JavaScript и XML») – подход к построению интерактивных пользовательских интерфейсов веб-приложений, заключающийся в «фоновом» обмене данными браузера с веб-сервером. В результате, при обновлении данных, веб-страница не перезагружается полностью и веб-приложения становятся более быстрыми и удобными",
      "group": 1
    },
    {
      "id": 2,
      "label": "Браузер",
      "desc": "программа для просмотра веб-страниц",
      "group": 2
    },
    {
      "id": 3,
      "label": "Content Management System",
      "desc": "система управления контентом сайта, автоматизирующая процесс обновления сайта, управлении его содержимым, добавлении, удалении и редактировании информации. Также CMS называют «движком» сайта"

    },
    {
      "id": 4,
      "label": "Web",
      "desc": "«всемирная паутина», основная служба в сети интернет, организованная на принципах гиперсреды, позволяющая получать доступ к информации на любых серверах, подключенных к сети",
      "group": 2
    },
    {
      "id": 5,
      "label": "Cascading Style Sheets",
      "desc": "язык создания стилей, определяющих внешний вид элементов",
      "group": 1
    },
    {
      "id": 6,
      "label": "Domain name system",
      "desc": "доменная система имен, протокол и система обозначений для сопоставления адресов IP и имен, понятных пользователю",
      "group": 2
    },
    {
      "id": 7,
      "label": "HTTP-протокол",
      "desc": "(Hyper Text Transfer Protocol) – протокол, обеспечивающий взаимодействие пользователя, запрашивающего доступ к web-документам, с сервером, предоставляющим возможность такого доступа",
      "group": 2
    },
    {
      "id": 8,
      "label": "HTML",
      "desc": "язык разметки гипертекста, позволяющий с помощью управляющих меток (тэгов) определять структуру и внешний вид HTML-документа (web-страницы) при отображении в браузере",
      "group": 1
    },
    {
      "id": 9,
      "label": "IP-адрес",
      "desc": "уникальный адрес компьютера в интернете",
      "group": 2
    },
    {
      "id": 10,
      "label": "Backup",
      "desc": "резервное копирование информации, содержащейся на сервере, создание архива данных",
      "group": 1
    },
    {
      "id": 11,
      "label": "Universal Resource Locator",
      "desc": "адрес страницы в интернете, состоящий из доменного имени, пути к странице на сайте и имени файла страницы",
      "group": 2
    },
    {
      "id": 12,
      "label": "JavaScript",
      "desc": "мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript",
      "group": 1
    },
    {
      "id": 13,
      "label": "Node",
      "desc": "программная платформа, основанная на движке V8, превращающая JavaScript из узкоспециализированного языка в язык общего назначения",
      "group": 1
    },
    {
      "id": 14,
      "label": "Домен",
      "desc": "(англ. domain — область) адрес сайта в Интернете, может содержать буквы, цифры и дефис. Каждое доменное имя состоит из нескольких частей (уровней), разделенных точками",
      "group": 2
    }
  ],
  "edges": [
    {
      "from": 3,
      "to:": 13,
      "label": "использует технологию"
    },
    {
      "from": 3,
      "to": 12,
      "label": "использует технологию"
    },
    {
      "from": 3,
      "to:": 8,
      "label": "использует технологию"
    },
    {
      "from": 3,
      "to": 5,
      "label": "использует технологию"
    },
    {
      "from": 3,
      "to:": 1,
      "label": "использует технологию"
    },
    {
      "from": 3,
      "to": 10,
      "label": "содержит"
    },
    {
      "from": 4,
      "to:": 2,
      "label": "является частью"
    },
    {
      "from": 6,
      "to:": 2,
      "label": "является частью"
    },
    {
      "from": 7,
      "to:": 2,
      "label": "является частью"
    },
    {
      "from": 9,
      "to:": 2,
      "label": "является частью"
    },
    {
      "from": 14,
      "to:": 9,
      "label": "является частью"
    },
    {
      "from": 11,
      "to:": 2,
      "label": "является частью"
    }
  ]
}
