{
  "Ajax": "(англ. Asynchronous Javascript and XML – «асинхронный JavaScript и XML») – подход к построению интерактивных пользовательских интерфейсов веб-приложений, заключающийся в «фоновом» обмене данными браузера с веб-сервером. В результате, при обновлении данных, веб-страница не перезагружается полностью и веб-приложения становятся более быстрыми и удобными",
  "Backup": "резервное копирование информации, содержащейся на сервере, создание архива данных",
  "Content Management System": "система управления контентом сайта, автоматизирующая процесс обновления сайта, управлении его содержимым, добавлении, удалении и редактировании информации. Также CMS называют «движком» сайта",
  "Cookie": "получение любым сайтом информации о браузере пользователя, то есть запись на жесткий диск компьютера пользователя специальной текстовой строки",
  "Cascading Style Sheets": "язык создания стилей, определяющих внешний вид элементов",
  "Dynamic HTML": "это способ создания интерактивных веб-страниц, использующий сочетание статичного языка разметки HTML, встраиваемого скриптового языка JavaScript, каскадных таблиц стилей CSS  и DOM (объектной модели документа)",
  "Domain name system": "доменная система имен, протокол и система обозначений для сопоставления адресов IP и имен, понятных пользователю",
  "HTTP-протокол": "(Hyper Text Transfer Protocol) – протокол, обеспечивающий взаимодействие пользователя, запрашивающего доступ к web-документам, с сервером, предоставляющим возможность такого доступа",
  "HTML": "язык разметки гипертекста, позволяющий с помощью управляющих меток (тэгов) определять структуру и внешний вид HTML-документа (web-страницы) при отображении в браузере",
  "IP-адрес": "уникальный адрес компьютера в интернете",
  "Web": "«всемирная паутина», основная служба в сети интернет, организованная на принципах гиперсреды, позволяющая получать доступ к информации на любых серверах, подключенных к сети",
  "Universal Resource Locator": "адрес страницы в интернете, состоящий из доменного имени, пути к странице на сайте и имени файла страницы",
  "Браузер": "программа для просмотра веб-страниц",
  "Гиперссылка": "графический или текстовый объект, ссылающийся на другой ресурс в сети",
  "Домен": "(англ. domain — область) адрес сайта в Интернете, может содержать буквы, цифры и дефис. Каждое доменное имя состоит из нескольких частей (уровней), разделенных точками",
  "Sitemap": "отдельная страница на сайте, на которой  представлены все разделы и подразделы сайта со ссылками на данные разделы",
  "Кодировка": "(англ. character encoding) система, в которой описывается соответствие определённого символа и числа. Любой символ, который мы видим, для компьютера является набором битов (единиц и нулей). Компьютер преобразует с помощью системы данные в привычные нами символы (буквы, цифры, знаки). \nВ России употребляются две кодировки символов: UTF-8 (Юникод) и Windows-1251",
  "Контент": "(англ. Content — содержание)  это вся информация, расположенная на сайте: текст, изображения, аудио- и видеоматериалы",
  "Кроссбраузерность": "(от англ. сross – пересечение, browser – программное средство просмотра) отображение и работоспособность сайта одинаково во всех популярных браузерах",
  "Кеширование": "сохранение некоторых ресурсоемких данных в памяти браузера, жесткого диска, процессора или веб-сервера",
  "Мета-тег": "(англ. meta tags) HTML теги для структурирования метаданных о странице сайта для поисковых роботов. Обычно указываются в разделе страницы и начинаются с тега",
  "Поисковая система": "(англ. search engine) компьютерная система для поиска информации в Интернете",
  "Хостинг": "(англ. hosting) - услуга по размещению информации на сервере",
  "Юникод": "(англ. Unicode) универсальный стандарт кодирования символов, с помощью которого можно отобразить любой существующий язык, использующий письменность. Один символ кодируется двумя байтами, поэтому используется 65536 символов",
  "HTTPS-протокол": "протокол HTTP c дополнительным шифрованием. Все данные, которые передаются по этому протоколу, защищены",
  "JavaScript": "мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript",
  "Node": "программная платформа, основанная на движке V8, превращающая JavaScript из узкоспециализированного языка в язык общего назначения",
  "Secure Sockets Layer": "протокол, обеспечивающий безопасное соединение клиента с сервером"
}